chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz1024efg100.h
PLIB_INLINE SFR_TYPE* _TMR_PERIOD_MATCH_MODE_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &PR1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_6 :
            return &TMR6;
        case TMR_ID_8 :
            return &TMR8;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_ID_7 :
            return &TMR7;
        case TMR_ID_9 :
            return &TMR9;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return &TMR1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_6 :
            return &TMR6;
        case TMR_ID_8 :
            return &TMR8;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_ID_7 :
            return &TMR7;
        case TMR_ID_9 :
            return &TMR9;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_MODE_16BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_6 :
            return &T6CON;
        case TMR_ID_8 :
            return &T8CON;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_ID_7 :
            return (SFR_TYPE*)-1;
        case TMR_ID_9 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_MODE_32BIT_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &T2CON;
        case TMR_ID_4 :
            return &T4CON;
        case TMR_ID_6 :
            return &T6CON;
        case TMR_ID_8 :
            return &T8CON;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_ID_7 :
            return (SFR_TYPE*)-1;
        case TMR_ID_9 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_REGISTER_16BIT_LOW_32_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &PR2;
        case TMR_ID_4 :
            return &PR4;
        case TMR_ID_6 :
            return &PR6;
        case TMR_ID_8 :
            return &PR8;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_ID_7 :
            return (SFR_TYPE*)-1;
        case TMR_ID_9 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_LOW_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return &TMR2;
        case TMR_ID_4 :
            return &TMR4;
        case TMR_ID_6 :
            return &TMR6;
        case TMR_ID_8 :
            return &TMR8;
        case TMR_ID_3 :
            return (SFR_TYPE*)-1;
        case TMR_ID_5 :
            return (SFR_TYPE*)-1;
        case TMR_ID_7 :
            return (SFR_TYPE*)-1;
        case TMR_ID_9 :
            return (SFR_TYPE*)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_PERIOD_REGISTER_16BIT_HIGH_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_6 :
            return (SFR_TYPE*)-1;
        case TMR_ID_8 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return &PR3;
        case TMR_ID_5 :
            return &PR5;
        case TMR_ID_7 :
            return &PR7;
        case TMR_ID_9 :
            return &PR9;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _TMR_VALUE_REGISTER_16BIT_HIGH_VREG(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_TYPE*)-1;
        case TMR_ID_2 :
            return (SFR_TYPE*)-1;
        case TMR_ID_4 :
            return (SFR_TYPE*)-1;
        case TMR_ID_6 :
            return (SFR_TYPE*)-1;
        case TMR_ID_8 :
            return (SFR_TYPE*)-1;
        case TMR_ID_3 :
            return &TMR3;
        case TMR_ID_5 :
            return &TMR5;
        case TMR_ID_7 :
            return &TMR7;
        case TMR_ID_9 :
            return &TMR9;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_ENABLE_MASK(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_ON_MASK;
        case TMR_ID_2 :
            return _T2CON_ON_MASK;
        case TMR_ID_4 :
            return _T4CON_ON_MASK;
        case TMR_ID_6 :
            return _T6CON_ON_MASK;
        case TMR_ID_8 :
            return _T8CON_ON_MASK;
        case TMR_ID_3 :
            return _T3CON_ON_MASK;
        case TMR_ID_5 :
            return _T5CON_ON_MASK;
        case TMR_ID_7 :
            return _T7CON_ON_MASK;
        case TMR_ID_9 :
            return _T9CON_ON_MASK;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_STOP_IN_IDLE_MASK(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_SIDL_MASK;
        case TMR_ID_2 :
            return _T2CON_SIDL_MASK;
        case TMR_ID_4 :
            return _T4CON_SIDL_MASK;
        case TMR_ID_6 :
            return _T6CON_SIDL_MASK;
        case TMR_ID_8 :
            return _T8CON_SIDL_MASK;
        case TMR_ID_3 :
            return _T3CON_SIDL_MASK;
        case TMR_ID_5 :
            return _T5CON_SIDL_MASK;
        case TMR_ID_7 :
            return _T7CON_SIDL_MASK;
        case TMR_ID_9 :
            return _T9CON_SIDL_MASK;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_ASYNC_TIMER_WRITE_MASK(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWDIS_MASK;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_COUNTER_ASYNC_WRITE_IN_PROGRESS_MASK(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWIP_MASK;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_GATED_TIME_ACCUMULATION_MASK(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TGATE_MASK;
        case TMR_ID_2 :
            return _T2CON_TGATE_MASK;
        case TMR_ID_4 :
            return _T4CON_TGATE_MASK;
        case TMR_ID_6 :
            return _T6CON_TGATE_MASK;
        case TMR_ID_8 :
            return _T8CON_TGATE_MASK;
        case TMR_ID_3 :
            return _T3CON_TGATE_MASK;
        case TMR_ID_5 :
            return _T5CON_TGATE_MASK;
        case TMR_ID_7 :
            return _T7CON_TGATE_MASK;
        case TMR_ID_9 :
            return _T9CON_TGATE_MASK;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

